artillery-cluster.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 805
    },
    "firstCounterAt": 1671583336973,
    "firstHistogramAt": 1671583337013,
    "lastCounterAt": 1671583338234,
    "lastHistogramAt": 1671583338234,
    "firstMetricAt": 1671583336973,
    "lastMetricAt": 1671583338234,
    "period": 1671583330000,
    "summaries": {
      "http.response_time": {
        "min": 1,
        "max": 66,
        "count": 1000,
        "p50": 16,
        "median": 16,
        "p75": 22,
        "p90": 34.8,
        "p95": 43.4,
        "p99": 57.4,
        "p999": 62.2
      },
      "vusers.session_length": {
        "min": 258.2,
        "max": 588.7,
        "count": 50,
        "p50": 424.2,
        "median": 424.2,
        "p75": 487.9,
        "p90": 528.6,
        "p95": 539.2,
        "p99": 584.2,
        "p999": 584.2
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 1,
        "max": 66,
        "count": 1000,
        "p50": 16,
        "median": 16,
        "p75": 22,
        "p90": 34.8,
        "p95": 43.4,
        "p99": 57.4,
        "p999": 62.2
      },
      "vusers.session_length": {
        "min": 258.2,
        "max": 588.7,
        "count": 50,
        "p50": 424.2,
        "median": 424.2,
        "p75": 487.9,
        "p90": 528.6,
        "p95": 539.2,
        "p99": 584.2,
        "p999": 584.2
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 1000,
        "http.codes.200": 1000,
        "http.responses": 1000,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 805
      },
      "http.request_rate": null,
      "firstCounterAt": 1671583336973,
      "firstHistogramAt": 1671583337013,
      "lastCounterAt": 1671583338234,
      "lastHistogramAt": 1671583338234,
      "firstMetricAt": 1671583336973,
      "lastMetricAt": 1671583338234,
      "period": "1671583330000",
      "summaries": {
        "http.response_time": {
          "min": 1,
          "max": 66,
          "count": 1000,
          "p50": 16,
          "median": 16,
          "p75": 22,
          "p90": 34.8,
          "p95": 43.4,
          "p99": 57.4,
          "p999": 62.2
        },
        "vusers.session_length": {
          "min": 258.2,
          "max": 588.7,
          "count": 50,
          "p50": 424.2,
          "median": 424.2,
          "p75": 487.9,
          "p90": 528.6,
          "p95": 539.2,
          "p99": 584.2,
          "p999": 584.2
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 1,
          "max": 66,
          "count": 1000,
          "p50": 16,
          "median": 16,
          "p75": 22,
          "p90": 34.8,
          "p95": 43.4,
          "p99": 57.4,
          "p999": 62.2
        },
        "vusers.session_length": {
          "min": 258.2,
          "max": 588.7,
          "count": 50,
          "p50": 424.2,
          "median": 424.2,
          "p75": 487.9,
          "p90": 528.6,
          "p95": 539.2,
          "p99": 584.2,
          "p999": 584.2
        }
      }
    }
  ]
}